package HelloWorldLesson1;

public class HelloWorldLesson1 {
    public static void main(String[] args)
    {
        System.out.println("Hello World"); // это системный метод выводит текст, заданный в параметре метода
    }
}
/* Что такое кампиляция ?
Кампиляция - перевод кода из понятного вам, в код который понятен машине , этим собственно говоря занимается JDK*/
/* Папка src - там находятся те Java файлы , которые мы будем писать,те Java файлы , которые будут являться нашей программой */
/* Что такое класс?
Класс - способ логически отделять какую-то составную часть общего
Пример
Есть машина , машина это большой проект , большая программа , классы в ней это двигатель , руль , коробка передач
То есть классы - это составные части, которые играют каждую свою роль в общей программе */
/* Java файл - это код  на языке Java */
/* В классе есть методы, у каждого класса есть методы
Пример
У двигателя(класс) есть действия(методы) - запуститься , заглохнуть
Коробка передач(класс) есть действия(методы) - переключить передачу
 */
/* С метода main начинает работу программа Java
Метод main() - это стартовая точка любой программы в Java
Вы не можете получить доступ к другим методам не пройдя через main()
Метод всегда находится внутри класса
Всё в Java пишется внутри класса
 */